In [30]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd
import numpy.random as randn

In [41]:
import numpy.random as randn
ser=Series([11,21,31,41,51,61],index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

ser

1  a    11
   b    21
   c    31
2  a    41
   b    51
   c    61
dtype: int64

In [43]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [44]:
ser[1]

a    11
b    21
c    31
dtype: int64

In [45]:
ser[2]

a    41
b    51
c    61
dtype: int64

In [46]:
ser[:,'a']

1    11
2    41
dtype: int64

In [62]:
ser[1,'b']

21

In [65]:
ser[2,'c']

61

In [68]:
dframe=ser.unstack()

dframe

    a   b   c
1  11  21  31
2  41  51  61

In [74]:
dframe=DataFrame(np.arange(16).reshape(4,4),index=[['a','a','b','b'],[1,2,3,4]],columns=['WA','NY','LI','GA'])

dframe

     WA  NY  LI  GA
a 1   0   1   2   3
  2   4   5   6   7
b 3   8   9  10  11
  4  12  13  14  15

In [76]:
dframe.ix['a']

   WA  NY  LI  GA
1   0   1   2   3
2   4   5   6   7

In [77]:
dframe.ix['a',2]

WA    4
NY    5
LI    6
GA    7
Name: (a, 2), dtype: int32

In [80]:
dframe.ix[:,3]

a  1     3
   2     7
b  3    11
   4    15
Name: GA, dtype: int32

In [117]:
dframe1=DataFrame(np.arange(16).reshape(4,4),index=[['a1','a1','b1','b1'],[11,12,11,12]],columns=[['NY','NY','LI','GA'],['hot','clod','hot','clod']])

dframe1

       NY       LI   GA
      hot clod hot clod
a1 11   0    1   2    3
   12   4    5   6    7
b1 11   8    9  10   11
   12  12   13  14   15

In [118]:
dframe1.index.names= ['Index_1','Index_2']
dframe1.columns.names=['Cities','Temp']
dframe1

Cities           NY       LI   GA
Temp            hot clod hot clod
Index_1 Index_2
a1      11        0    1   2    3
        12        4    5   6    7
b1      11        8    9  10   11
        12       12   13  14   15

In [132]:
dframe1.swaplevel('Cities','Temp',axis=1)

Temp            hot clod hot clod
Cities           NY   NY  LI   GA
Index_1 Index_2
a1      11        0    1   2    3
        12        4    5   6    7
b1      11        8    9  10   11
        12       12   13  14   15

In [145]:
dframe1.sortlevel(1)

C:\Users\v-satnai\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

Cities           NY       LI   GA
Temp            hot clod hot clod
Index_1 Index_2
a1      11        0    1   2    3
b1      11        8    9  10   11
a1      12        4    5   6    7
b1      12       12   13  14   15

In [146]:
dframe1.sum(level='Cities',axis=1)

Cities           GA  LI  NY
Index_1 Index_2
a1      11        3   2   1
        12        7   6   9
b1      11       11  10  17
        12       15  14  25

In [147]:
dframe1.sum(level='Temp',axis=1)

Temp             clod  hot
Index_1 Index_2
a1      11          4    2
        12         12   10
b1      11         20   18
        12         28   26

In [148]:
dframe1.sum(1)

Index_1  Index_2
a1       11          6
         12         22
b1       11         38
         12         54
dtype: int64

In [149]:
dframe1.sum(0)

Cities  Temp
NY      hot     24
        clod    28
LI      hot     32
GA      clod    36
dtype: int64